app/controllers/schools_controller.rb

  def edit
    @school = School.find(params[:id])
---
SELECT  `schools`.* FROM `schools` WHERE `schools`.`id` = 91 LIMIT 1