app/controllers/schools_controller.rb

SELECT  `schools`.* FROM `schools` WHERE `schools`.`title` = 'scoala 4' LIMIT 1
---
  def search_school
    @school = School.search(search_school_params[:title])

SELECT  `schools`.* FROM `schools` WHERE `schools`.`id` = 91 LIMIT 1
---
	def show
    @school = School.find(params[:id])

INSERT INTO `schools` (`title`, `created_at`, `updated_at`) VALUES ('scoala2', '2019-07-18 07:49:46', '2019-07-18 07:49:46')
INSERT INTO `schools` (`title`, `created_at`, `updated_at`) VALUES ('liceul1', '2019-07-17 08:06:14', '2019-07-17 08:06:14')
INSERT INTO `users` (`email`, `encrypted_password`, `school_id`, `role`) VALUES ('administrator2@yahoo.com', '$2a$11$.iPhT2uWoj0IAapmImBEU.jKguB.sIa0TRnOBSTmqeelGqPfk8I5O', 91, 'admin')
---
  def create

    @school = School.create(school_params)

    @user = User.new(user_params)
    @user.school_id = @school.id
    @user.role = 'admin'
    @user.password_confirmation = @password

    unless @user.save!