app/controllers/users_controller.rb

  def index
   # @users = User.all
   # @school = School.find user_params[:school_id]
   # @user = User.all.select { |user| user.school_id == school.id }#user_params[:school_id] }
   @users = User.where(school_id: @school.id)
---
SELECT `users`.* FROM `users` WHERE `users`.`school_id` IS NULL

  def create_user
    @user = User.new(user_params_create)
    @user.school_id = current_user.school_id
    @user.password_confirmation = @password

    unless @user.save!
---
INSERT INTO `users` (`email`, `encrypted_password`, `school_id`, `role`) VALUES ('sdds@dsada', '$2a$11$PEkR.KrAZ/bKgG/kvhagAuvO9jJOS4pRYHvGMLBmpMc/TcRJ6f6Xm', 89, 'student')

  def update
    @user = User.find(params[:id])
    if @user.update(user_params)
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 35 LIMIT 1
UPDATE `users` SET `email` = 'adm333332@yahoo.com' WHERE `users`.`id` = 35

  def set_school
    @school = School.find(current_user.school_id)
---
SELECT  `schools`.* FROM `schools` WHERE `schools`.`id` = 87 LIMIT 1