app/models/school.rb

SELECT  `schools`.* FROM `schools` WHERE `schools`.`title` = 'scoala 4' LIMIT 1
---
	def self.search(search)
	  school=School.find_by(title: search)