app/controllers/users/sessions_controller.rb

SELECT  `schools`.* FROM `schools` WHERE `schools`.`id` = 88 LIMIT 1
SELECT  `users`.* FROM `users` WHERE `users`.`email` = 'adm1@yahoo.com' ORDER BY `users`.`id` ASC LIMIT 1
---
  def create
    @school = School.find user_params[:school_id]
    @user = User.where(email: user_params[:email]).first